In [1]:
%load_ext lab_black

In [2]:
import pandas as pd

In [4]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv("example")

In [7]:
df.to_csv("my_output")

In [11]:
pd.read_csv("my_output")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [12]:
df.to_csv("my_output_without_index", index=False)

In [15]:
pd.read_csv("my_output_without_index")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
dfex = pd.read_excel("Excel_Sample.xlsx", sheet_name="Sheet1")

In [23]:
dfex

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [27]:
dfex.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [31]:
dfex.drop(columns=["Unnamed: 0"])

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
dfex.drop("Unnamed: 0", axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
dataf = pd.read_html("http://www.fdic.gov/bank/individual/failed/banklist.html")

In [37]:
type(dataf)

list

In [41]:
len(dataf)

1

In [42]:
dataf[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [44]:
dataf[0].shape

(561, 6)